In [1]:
import pandas as pd

# Joining on different Column Labels & Indexes

In [2]:
men2004= pd.read_csv('../../Data/men2004.csv')
men2008= pd.read_csv('../../Data/men2008.csv')

In [58]:
men2004.head()

            Athlete  Medals
0   PHELPS, Michael       8
1       THORPE, Ian       4
2  SCHOEMAN, Roland       3
3    PEIRSOL, Aaron       3
4      CROCKER, Ian       3

In [59]:
men2008.head()

               Athlete  Medals
0      PHELPS, Michael       8
1         LOCHTE, Ryan       4
2       BERNARD, Alain       3
3      SULLIVAN, Eamon       3
4  LAUTERSTEIN, Andrew       3

In [64]:
men2004.columns = ["Name", "Medals"]
men2004

                          Name  Medals
0              PHELPS, Michael       8
1                  THORPE, Ian       4
2             SCHOEMAN, Roland       3
3               PEIRSOL, Aaron       3
4                 CROCKER, Ian       3
5             KITAJIMA, Kosuke       3
6              HANSEN, Brendan       3
7   VAN DEN HOOGENBAND, Pieter       3
8               HACKETT, Grant       3
9               MORITA, Tomomi       2
10                LEZAK, Jason       2
11               ROGAN, Markus       2
12               KELLER, Klete       2
13              HALL, Gary Jr.       2
14                LOCHTE, Ryan       2
15                WALKER, Neil       2
16           YAMAMOTO, Takashi       2
17          SPRENGER, Nicholas       1
18          OKUMURA, Yoshihiro       1
19              PARRY, Stephen       1
20               PEARSON, Todd       1
21              ZASTROW, Mitja       1
22          PELLICIARI, Matteo       1
23              WOODWARD, Gabe       1
24            SERDINOV, Andriy       1
25                 VENDT, Erik       1
26      ROSOLINO, Massimiliano       1
27        VEENS, Mark Hermanus       1
28            RUPPRATH, Thomas       1
29           VANDERKAAY, Peter       1
30            TOWNSEND, Darian       1
31              STEVENS, Craig       1
32              NEETHLING, Ryk       1
33              BOVELL, George       1
34                MEEUW, Helge       1
35        FLOREA, Razvan Ionut       1
36       CAPPELLAZZO, Federico       1
37             CERCATO, Simone       1
38                CONRAD, Lars       1
39                CSEH, Laszlo       1
40               DAVIES, David       1
41              DRAGANJA, Duje       1
42            DRIESEN, Steffen       1
43             DUBOSCQ, Hugues       1
44                DUSING, Nate       1
45               FERNS, Lyndon       1
46              GANGLOFF, Mark       1
47           MATKOVICH, Antony       1
48            GOLDBLATT, Scott       1
49              GYURTA, Daniel       1
50              JENSEN, Larsen       1
51             KENKHUIS, Johan       1
52                KETCHUM, Dan       1
53               KLIM, Michael       1
54          KRAYZELBURG, Lenny       1
55                KRUPPA, Jens       1
56         BREMBILLA, Emiliano       1
57            MAGNINI, Filippo       1
58         ZWERING, Klaas-Erik       1

## We change  tha column 'Athlete' to ' Name' don't use on='Athlete' in the merge because the column is not exist in both dataframes. 
## We use left_on and right_on to specify the columns to join on.
## First Df is men2004 means this df is left df and second df is men2008 means this df is right df.
## In left side we have 'Name' column and in right side we have 'Athlete' column.

In [46]:
men0408 = men2004.merge(men2008, how='outer', left_on='Name', right_on='Athlete', suffixes=['-2004', '_2008'], indicator=True)
men0408

,Name,Medals-2004,Athlete,Medals_2008,_merge
0,NaN,NaN,"ADRIAN, Nathan",1.0,right_only
1,NaN,NaN,"BERENS, Ricky",1.0,right_only
2,NaN,NaN,"BERNARD, Alain",3.0,right_only
3,NaN,NaN,"BOUSQUET, Frederick",1.0,right_only
4,"BOVELL, George",1.0,NaN,NaN,left_only
...,...,...,...,...,...
100,"WOODWARD, Gabe",1.0,NaN,NaN,left_only
101,"YAMAMOTO, Takashi",2.0,NaN,NaN,left_only
102,"ZASTROW, Mitja",1.0,NaN,NaN,left_only
103,NaN,NaN,"ZHANG, Lin",1.0,right_only
104,"ZWERING, Klaas-Erik",1.0,NaN,NaN,left_only

And now fill the missing values in the 'Name' column with the values in the 'Athlete' column ( we want a column with all names, not a mix of names and NaNs).

In [42]:
men0408.Name.fillna(men0408.Athlete, inplace=True)

In [43]:
men0408

,Name,Medals-2004,Athlete,Medals_2008,_merge
0,"ADRIAN, Nathan",NaN,"ADRIAN, Nathan",1.0,right_only
1,"BERENS, Ricky",NaN,"BERENS, Ricky",1.0,right_only
2,"BERNARD, Alain",NaN,"BERNARD, Alain",3.0,right_only
3,"BOUSQUET, Frederick",NaN,"BOUSQUET, Frederick",1.0,right_only
4,"BOVELL, George",1.0,NaN,NaN,left_only
...,...,...,...,...,...
100,"WOODWARD, Gabe",1.0,NaN,NaN,left_only
101,"YAMAMOTO, Takashi",2.0,NaN,NaN,left_only
102,"ZASTROW, Mitja",1.0,NaN,NaN,left_only
103,"ZHANG, Lin",NaN,"ZHANG, Lin",1.0,right_only
104,"ZWERING, Klaas-Erik",1.0,NaN,NaN,left_only

Now we can drop the 'Athlete' column and the '_merge' column.
Axis=1 means we are dropping columns, not rows.

In [44]:
men0408.drop(columns=['Athlete', '_merge'], axis=1, inplace=True)

In [45]:
men0408

                    Name  Medals-2004  Medals_2008
0         ADRIAN, Nathan          NaN          1.0
1          BERENS, Ricky          NaN          1.0
2         BERNARD, Alain          NaN          3.0
3    BOUSQUET, Frederick          NaN          1.0
4         BOVELL, George          1.0          NaN
..                   ...          ...          ...
100       WOODWARD, Gabe          1.0          NaN
101    YAMAMOTO, Takashi          2.0          NaN
102       ZASTROW, Mitja          1.0          NaN
103           ZHANG, Lin          NaN          1.0
104  ZWERING, Klaas-Erik          1.0          NaN

[105 rows x 3 columns]